Autodesk.Revit.DB.DirectContext3D.IndexLine.GetSizeInShortInts
Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Returns:
The number of short integers occupied by the primitive.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexLine.Index1
The index of the line segment's second vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexLine.Index0
The index of the line segment's first vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexLine.#ctor(System.Int32,System.Int32)
Constructs the line segment primitive.
index0:
The index of the line segment's first vertex.
index1:
The index of the line segment's second vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexLine
A line segment primitive consisting of two indices.
Since:
2017